# GetScreen

## Description
Procedure GetScreen returns the top-left and bottom-right corners of the display screen. These values will change as different sized screens are used. This procedure can be utilized to aid in development of dialog boxes, or as a check of screen size for sizing or displaying custom dialogs.

```pascal
PROCEDURE GetScreen(
				VAR x1 : INTEGER;
				VAR y1 : INTEGER;
				VAR x2 : INTEGER;
				VAR y2 : INTEGER);
```

```python

def vs.GetScreen():
    return (x1, y1, x2, y2)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|x1|INTEGER|Returns X coordinate of top left of screen.|
|y1|INTEGER|Returns Y coordinate of top left of screen.|
|x2|INTEGER|Returns X coordinate of bottom right of screen.|
|y2|INTEGER|Returns Y coordinate of bottom right of screen.|

## Examples
```pascal
PROCEDURE Example;

VAR

	x1, y1, x2, y2 :INTEGER;

BEGIN

	GetScreen(x1, y1, x2, y2);

	Message(x1,' ',y1,' ',x2,' ',y2);

END;

RUN(Example);
```

## Version
Availability: from MiniCAD
## Category
* Utility